{"version":"1.0","truncation":{"max_length":24,"strategy":"LongestFirst","stride":0},"padding":{"strategy":{"Fixed":24},"direction":"Left","pad_to_multiple_of":null,"pad_id":1,"pad_type_id":3,"pad_token":"[PAD]"},"added_tokens":[{"id":0,"special":true,"content":"[UNK]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":1,"special":true,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":2,"special":true,"content":"[CLS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":3,"special":true,"content":"[SEP]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false},{"id":4,"special":true,"content":"[MASK]","single_word":false,"lstrip":true,"rstrip":false,"normalized":true}],"normalizer":{"type":"Sequence","normalizers":[{"type":"Replace","pattern":{"String":"``"},"content":"\""},{"type":"Replace","pattern":{"String":"''"},"content":"\""},{"type":"NFKD"},{"type":"StripAccents"},{"type":"Precompiled",