{"do_lower_case": false, "remove_space": true, "keep_accents": false, "bos_token": "[CLS]", "eos_token": "[SEP]", "unk_token": "[UNK]", "sep_token": "[SEP]", "pad_token": "[PAD]", "cls_token": "[CLS]", "mask_token": {"content": "[MASK]", "single_word": false, "lstrip": true, "rstrip": false, "normalized": true, "__type": "AddedToken"}, "additional_special_tokens": null, "sp_model_kwargs": {}, "truncation_side": "left", "special_tokens_map_file": "/root/.cache/huggingface/transformers/2ad28172340bc816ccd4ffc7a51682e0c5c89a88a0d618ab40eeb81a3980b356.3db0799720217f7da35e92d033f167ac40c8d2c02fa035130b7bb070f6355074", "tokenizer_file": null, "name_or_path": "skt/kobert-base-v1", "tokenizer_class": "KoBERTTokenizer"}