{
    "en":{

        "sub_title":"Time series Forecasting",

        "expander_upload_arrange":"Uplaod file and Decide date scope",

        "sample_data_checkbox":"Preview sample data",
        "sample_data_name":"Sample CSV data",
        "sample_data_mode_start":"Start with sample data",
        "sample_data_mode":"You are currently in sample data mode.",
        
        "decide_date_column":"Decide date column",
        "decide_pred_column":"Decide prediction column",

        "invalid_format":"Invalid format.",

        "train_data_arrange":"Decide train data scope",
        "val_data_arrange":"The test data range is specified from the end to the beginning of the training data.",
        "pred_data_arrange":"The additional predictive data provides 10% of the range of the test data.",

        "date_column_not_exist_select_column":"The range of dates doesn't exist, or please set the column correctly",

        "upload_train_csv":"Please upload a file",

        "upload_info":"if you uploads file, you can choice column and decide data scope",

        "expander_train_prediction":"Training model and prediction",

        "HP_learning_rate":"Learning rate :question:",
        "HP_epoch":"Epoch :question:",
        "HP_window_size":"Window size :question:",
        "HP_forecast_horizon":"Horizon Factor :question:",

        "ex_learning_rate":"Learning Rate\n\nThe learning rate is a hyperparameter that determines how quickly the model learns. If the learning rate is too high, we may overshoot the optimal solution. Conversely, if the learning rate is too low, the learning process can be very slow. \n\nTherefore, finding the appropriate learning rate is important. As an initial value, you can try values like 0.1, 0.01, or 0.001 according to the rule of thumb.",
        "ex_epoch":"Epoch\n\nAn epoch refers to the number of times the entire dataset is trained.\n\nThe more epochs, the more opportunities the model has to learn. However, too many epochs may lead to overfitting, a phenomenon where the model fits the training data too well, thus decreasing its predictive performance on new data.",
        "ex_window_size":"Window Size\n\nIn time series forecasting, the window size is a parameter that decides how much input data is used. The window size can directly influence the performance of the prediction model and needs to be well-chosen.\n\nFor example, in an LSTM model used for stock price prediction, if the window size is 7 days, this means that data from the past 7 days is used to predict the future stock price.",
        "ex_forecast_horizon":"Forecast Horizon\n\nThis is a parameter that indicates the time range you want to predict.\n\nFor instance, in stock price prediction, if the forecast horizon is 1, this means you are trying to predict the stock price of the next day, and if it's 7, you are trying to predict the stock price for the next week.\n\nPredicting further into the future becomes more challenging, and there's a potential for prediction errors to accumulate. Therefore, the forecast horizon should be used to balance between the time range you want to predict and the prediction accuracy.",

        "explanation_title":"Explanation",
        "explanation_text":"if you click hyperparameter name or ?, you can see hyperparameter explanation",
        
        "training_validation_model_button":"Train Model",
        "training_model_spinner":"Model is training. Don't click other button",

        "training_model_complete":"Training complete",
        "prediction_model_button":"Prediction",

        "after_train":"Please training model",

        "time_series_forecasting":"Time series forecasting result",

        "pred_graph" : "You can see the result graph once the learning and prediction processes are complete.",

        "pred_after_down": "You can download the trained model after training and prediction.",

        "model_download":"Download Model "

        }
}
